#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warnings:

- Argument is deprecated
  on main.tf line 25

To see the full warning notes, run Terraform without -compact-warnings.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/example-org-d0589e/MLTests/runs/run-NzJ6aa6h9fhgYMkm

Waiting for the plan to start...

Terraform v1.4.4
on linux_amd64
Initializing plugins and modules...
aws_s3_bucket.my_bucket: Refreshing state... [id=my-bucket20230409011707248800000001]
aws_s3_bucket_public_access_block.my_bucket: Refreshing state... [id=my-bucket20230409011707248800000001]
null_resource.my_resource: Refreshing state... [id=5966141732590697479]
aws_s3_bucket.my_bucket: Drift detected (delete)
aws_s3_bucket_public_access_block.my_bucket: Drift detected (delete)
╷
│ Warning: Argument is deprecated
│
│   with aws_s3_bucket.my_bucket,
│   on main.tf line 25, in resource "aws_s3_bucket" "my_bucket":
│   25:   acl           = "private"
│
│ Use the aws_s3_bucket_acl resource instead
╵
╷
│ Warning: Argument is deprecated
│
│   with aws_s3_bucket.my_bucket,
│   on main.tf line 25, in resource "aws_s3_bucket" "my_bucket":
│   25:   acl           = "private"
│
│ Use the aws_s3_bucket_acl resource instead
╵

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_s3_bucket.my_bucket has been deleted
  - resource "aws_s3_bucket" "my_bucket" {
      - id                          = "my-bucket20230409011707248800000001" -> null
        tags                        = {}
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.my_bucket will be created
  + resource "aws_s3_bucket" "my_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "my-bucket"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_public_access_block.my_bucket will be created
  + resource "aws_s3_bucket_public_access_block" "my_bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # null_resource.my_resource must be replaced
-/+ resource "null_resource" "my_resource" {
      ~ id       = "5966141732590697479" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "bucket_id" = "my-bucket20230409011707248800000001" -> (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 1 to destroy.

```

</details>

*Pusher: @cailen, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*